tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sass/sass"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# SSL/TLS cryptography library
brew "openssl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline", link: true
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# YAML Parser
brew "libyaml"
# Scalable distributed version control system
brew "mercurial"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Open source relational database management system
brew "mysql-client"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# YubiKey personalization library and tool
brew "ykpers"
# Tool for managing your YubiKey configuration
brew "ykman"
# Tracks most-used directories to make cd smarter
brew "z"
brew "asdf"
brew "rustup-init"
brew "starship"
cask "docker"
cask "iterm2"
cask "font-source-code-pro"
cask "mysql-utilities"
cask "contexts"
cask "pastebot"
cask "font-hack"
cask "1password"
cask "visual-studio-code"
cask "spotify"
